tutorials/heatTransfer/chtMultiRegionFoam/windshieldCondensation/system/controlDict.5
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         90;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   10;

purgeWrite      0;

writeFormat     binary;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           5;

maxDi           10;

maxDeltaT       1;

functions
{
    H2O
    {
        type            scalarTransport;

        functionObjectLibs ("libutilityFunctionObjects.so");

        resetOnStartUp  no;

        region cabin;


        // employ schemes used by U to the scalar transport equation
        // note: field name is given by the name of the function, in this case
        // 'scalar1'
        autoSchemes     no;

        fvOptions
        {
        }
    }

    fileUpdate
    {
        type                timeActivatedFileUpdate;
        functionObjectLibs  ("libutilityFunctionObjects.so");
        outputControl       timeStep;
        outputInterval      1;
        region              cabin;
        fileToUpdate        "$FOAM_CASE/system/controlDict";

        timeVsFile
        (
            ( 1     "$FOAM_CASE/system/controlDict.0" )
            ( 5     "$FOAM_CASE/system/controlDict.5")
            ( 20    "$FOAM_CASE/system/controlDict.20")
            ( 60    "$FOAM_CASE/system/controlDict.60")
        );
    }
}


// ************************************************************************* //
