tutorials/heatTransfer/chtMultiRegionFoam/windshieldCondensation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          70;
        startFace       648417;
    }
    outlet
    {
        type            patch;
        nFaces          2250;
        startFace       648487;
    }
    exterior
    {
        type            patch;
        nFaces          2250;
        startFace       650737;
    }
    symmetry
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          4365;
        startFace       652987;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          15071;
        startFace       657352;
    }
)

// ************************************************************************* //
